src/Catalogs/Радар_Проекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Радар_Проекты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВыгрузки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФорматыВыгрузки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяКонфигурация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьМногопоточность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПартии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумПотоков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Радар_Проекты/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ВнешняяКонфигурация
		И Не ЗначениеЗаполнено(ЭтотОбъект.ПутьКонфигурации) Тогда
		
		Радар_Сервер.СообщитьПолеНеЗаполнено(ЭтотОбъект, "ПутьКонфигурации", Отказ);
		
	КонецЕсли; 
	
	Если Не Радар_КлиентСервер.ЭтоФайловаяБаза()
		И ЭтотОбъект.ИспользоватьМногопоточность Тогда
		
		Если Не ЗначениеЗаполнено(ЭтотОбъект.РазмерПартии) Тогда
			
			Радар_Сервер.СообщитьПолеНеЗаполнено(ЭтотОбъект, "РазмерПартии", Отказ);
			
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(ЭтотОбъект.МаксимумПотоков) Тогда
			
			Радар_Сервер.СообщитьПолеНеЗаполнено(ЭтотОбъект, "МаксимумПотоков", Отказ);
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры
